print("符号表：1代表【+】   2代表【-】   3代表【*】   4代表【/】   5代表【幂运算】")
#符号声明
a=float(input('请输入第一个数字：')) 
f=int(input('请输入符号：'))
b=float(input('请输入第二个数字：'))
if f==1:
    c=a+b
elif f==2:
    c=a-b
elif f==3:
    c=a*b
elif f==4:
    c=a/b
elif f==5:
    c=a**b
else:
    print('--------------------------------------------------------------')
    print('您输入了不存在的数字，请按照本程序符号表提供的数字进行操作。')
    print('--------------------------------------------------------------')
print()
print()
print('--------------------------------------------------------------')
print('得出的结果为：',c)
print('--------------------------------------------------------------')
print()
input('键入enter退出程序......')
#程序制作者:Stealer
#qq:3150345455
